nxp-mcuxpresso/mcux-sdk-examples/evkbmimxrt1060/edgefast_bluetooth_examples/a2dp_sink/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINSM2_SDIO_RST_GPIO                                     GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINSM2_SDIO_RST_GPIO_PIN                                   24U   /*!< GPIO pin number */
#define BOARD_INITPINSM2_SDIO_RST_GPIO_PIN_MASK                      (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINSM2_SDIO_RST_PORT                                     GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINSM2_SDIO_RST_PIN                                        24U   /*!< PORT pin number */
#define BOARD_INITPINSM2_SDIO_RST_PIN_MASK                           (1U << 24U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinsM2(void);

#define BOARD_DEINITARDUINOUARTPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0xF00000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_AD_B1_04 (coord L12), CSI_PIXCLK/J46[8]/BT_DEV_WAKE/U9[9]/J33[3] */
/* Routed pin properties */
#define BOARD_DEINITARDUINOUARTPINS_CSI_PIXCLK_PERIPHERAL                  GPIO1   /*!< Peripheral name */
#define BOARD_DEINITARDUINOUARTPINS_CSI_PIXCLK_SIGNAL                    gpio_io   /*!< Signal name */
#define BOARD_DEINITARDUINOUARTPINS_CSI_PIXCLK_CHANNEL                       20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_DEINITARDUINOUARTPINS_CSI_PIXCLK_GPIO                        GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_DEINITARDUINOUARTPINS_CSI_PIXCLK_GPIO_PIN                      20U   /*!< GPIO pin number */
#define BOARD_DEINITARDUINOUARTPINS_CSI_PIXCLK_GPIO_PIN_MASK         (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_DEINITARDUINOUARTPINS_CSI_PIXCLK_PORT                        GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_DEINITARDUINOUARTPINS_CSI_PIXCLK_PIN                           20U   /*!< PORT pin number */
#define BOARD_DEINITARDUINOUARTPINS_CSI_PIXCLK_PIN_MASK              (1U << 20U)   /*!< PORT pin mask */

/* GPIO_AD_B1_05 (coord K12), CSI_MCLK/J46[12]/WL_DEV_WAKE/U9[10]/J33[4] */
/* Routed pin properties */
#define BOARD_DEINITARDUINOUARTPINS_CSI_MCLK_PERIPHERAL                    GPIO1   /*!< Peripheral name */
#define BOARD_DEINITARDUINOUARTPINS_CSI_MCLK_SIGNAL                      gpio_io   /*!< Signal name */
#define BOARD_DEINITARDUINOUARTPINS_CSI_MCLK_CHANNEL                         21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_DEINITARDUINOUARTPINS_CSI_MCLK_GPIO                          GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_DEINITARDUINOUARTPINS_CSI_MCLK_GPIO_PIN                        21U   /*!< GPIO pin number */
#define BOARD_DEINITARDUINOUARTPINS_CSI_MCLK_GPIO_PIN_MASK           (1U << 21U)   /*!< GPIO pin mask */
#define BOARD_DEINITARDUINOUARTPINS_CSI_MCLK_PORT                          GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_DEINITARDUINOUARTPINS_CSI_MCLK_PIN                             21U   /*!< PORT pin number */
#define BOARD_DEINITARDUINOUARTPINS_CSI_MCLK_PIN_MASK                (1U << 21U)   /*!< PORT pin mask */

/* GPIO_AD_B1_06 (coord J12), CSI_VSYNC/J46[18]/BT_UART_TXD/U9[4]/I2C3_SCL/J24[3]/J23[13]/J16[2] */
/* Routed pin properties */
#define BOARD_DEINITARDUINOUARTPINS_CSI_VSYNC_PERIPHERAL                   GPIO1   /*!< Peripheral name */
#define BOARD_DEINITARDUINOUARTPINS_CSI_VSYNC_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_DEINITARDUINOUARTPINS_CSI_VSYNC_CHANNEL                        22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_DEINITARDUINOUARTPINS_CSI_VSYNC_GPIO                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_DEINITARDUINOUARTPINS_CSI_VSYNC_GPIO_PIN                       22U   /*!< GPIO pin number */
#define BOARD_DEINITARDUINOUARTPINS_CSI_VSYNC_GPIO_PIN_MASK          (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_DEINITARDUINOUARTPINS_CSI_VSYNC_PORT                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_DEINITARDUINOUARTPINS_CSI_VSYNC_PIN                            22U   /*!< PORT pin number */
#define BOARD_DEINITARDUINOUARTPINS_CSI_VSYNC_PIN_MASK               (1U << 22U)   /*!< PORT pin mask */

/* GPIO_AD_B1_07 (coord K10), CSI_HSYNC/J46[16]/BT_UART_RXD/U10[20]/I2C3_SDA/J24[5]/J23[15]/J16[1] */
/* Routed pin properties */
#define BOARD_DEINITARDUINOUARTPINS_CSI_HSYNC_PERIPHERAL                   GPIO1   /*!< Peripheral name */
#define BOARD_DEINITARDUINOUARTPINS_CSI_HSYNC_SIGNAL                     gpio_io   /*!< Signal name */
#define BOARD_DEINITARDUINOUARTPINS_CSI_HSYNC_CHANNEL                        23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_DEINITARDUINOUARTPINS_CSI_HSYNC_GPIO                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_DEINITARDUINOUARTPINS_CSI_HSYNC_GPIO_PIN                       23U   /*!< GPIO pin number */
#define BOARD_DEINITARDUINOUARTPINS_CSI_HSYNC_GPIO_PIN_MASK          (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_DEINITARDUINOUARTPINS_CSI_HSYNC_PORT                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_DEINITARDUINOUARTPINS_CSI_HSYNC_PIN                            23U   /*!< PORT pin number */
#define BOARD_DEINITARDUINOUARTPINS_CSI_HSYNC_PIN_MASK               (1U << 23U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_DeinitArduinoUARTPins(void);

/* GPIO_AD_B1_14 (coord G12), SAI1_TX_BCLK/J35[1]/DC_I2S1_TX_BCLK/U23[23]/BT_PCM_BCLK/U9[7]/U10[17]/CSI_D3/J46[4] */
/* Routed pin properties */
#define BOARD_INIT_USDAUDIO_PINS_CSI_D3_PERIPHERAL                          SAI1   /*!< Peripheral name */
#define BOARD_INIT_USDAUDIO_PINS_CSI_D3_SIGNAL                       sai_tx_bclk   /*!< Signal name */

/* GPIO_AD_B1_12 (coord H12), SAI1_RXD/J41[1]/DC_I2S1_RX_D0/J23[11]/BT_PCM_RXD/U10[18]/CSI_D5/J46[5] */
/* Routed pin properties */
#define BOARD_INIT_USDAUDIO_PINS_CSI_D5_PERIPHERAL                          SAI1   /*!< Peripheral name */
#define BOARD_INIT_USDAUDIO_PINS_CSI_D5_SIGNAL                      sai_rx_data0   /*!< Signal name */

/* GPIO_AD_B1_15 (coord J14), SAI1_TX_SYNC/J36[1]/DC_I2S1_TX_SYNC/U23[16]/BT_PCM_SYNC/U9[8]/U10[16]/CSI_D2/J46[6] */
/* Routed pin properties */
#define BOARD_INIT_USDAUDIO_PINS_CSI_D2_PERIPHERAL                          SAI1   /*!< Peripheral name */
#define BOARD_INIT_USDAUDIO_PINS_CSI_D2_SIGNAL                       sai_tx_sync   /*!< Signal name */

/* GPIO_AD_B1_13 (coord H11), SAI1_TXD/J37[1]/DC_I2S1_TX_D0/J23[17]/BT_PCM_TXD/U9[6]/CSI_D4/J46[3] */
/* Routed pin properties */
#define BOARD_INIT_USDAUDIO_PINS_CSI_D4_PERIPHERAL                          SAI1   /*!< Peripheral name */
#define BOARD_INIT_USDAUDIO_PINS_CSI_D4_SIGNAL                      sai_tx_data0   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_USDAudio_Pins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
